# Terminal tools
brew "zsh"
brew "zsh-syntax-highlighting"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "asdf"
brew "curl"
brew "fzf"
brew "fd"
brew "bat"
brew "exa"
brew "neovim"
brew "protobuf"
brew "tmux"
brew "git"
brew "gitui"
brew "git-delta"

# programming
brew "rust"
cask "docker"
brew "yarn"

# Applications
cask "discord"
cask "slack"
cask "visual-studio-code"
cask "zoom"
cask "notion"

# fonts
tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"
cask "font-noto-sans-cjk"
cask "font-noto-sans-cjk-kr"
